# Напишите код для описания геометрической фигуры.
# Создайте класс «прямоугольник» с помощью метода  __init__(). На выходе в консоли вам необходимо получить
# длину и ширину с итоговыми значениями.

from rectangle import Rectangle

rectangle_0 = Rectangle(2, 4)
print("площадь прямоугольника: ", rectangle_0.get_area())

