# Напишите программу, которой на вход подается последовательность чисел через пробел, а также запрашивается 
# у пользователя любое число. В качестве задания повышенного уровня сложности можете выполнить проверку соответствия 
# указанному в условии ввода данных.
# Далее программа работает по след. алгоритму
# 1. Преобразование введенной последовательности в список
# 2. Сортировка списка по возрастанию элементов в нем (для реализации сортировки определите функцию)
# 3. Устанавливается номер позиции элемента, который меньше введенного пользователем число, а следующий за ним больше 
# или равен этому числу.
# При установке позиции элемента воспользуйтесь алгоритмом двоичного поиска, который был рассмотрен в этом модуле.
# Реализуйте его также отдельной функцией 
